out/CVE-2025-2746/variant-handoff.json

{
  "template_id": "CVE-2025-2746",
  "template_path": "nuclei-templates/http/cves/2025/CVE-2025-2746.yaml",
  "exploit_index": 0,
  "classification": {
    "families": ["auth-bypass"],
    "injection_point": "POST /CMSPages/Staging/SyncServer.asmx - SOAP XML body with wsse:UsernameToken (no password required); service processes request without authentication",
    "injection_slot": "REQUEST_BODY",
    "protocol": "http"
  },
  "payload_samples": [
    {
      "label": "poc",
      "content": "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Header><wsse:Security xmlns:wsse=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd\" xmlns:wsu=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd\"><wsse:UsernameToken><wsse:Username>admin</wsse:Username></wsse:UsernameToken></wsse:Security></soap:Header><soap:Body><ProcessSynchronizationTaskData xmlns=\"http://localhost/SyncWebService/SyncServer\"><stagingTaskData><![CDATA[<test123abc>]]></stagingTaskData></ProcessSynchronizationTaskData></soap:Body></soap:Envelope>",
      "note": "SOAP XML body from template's raw request block; variable {{rand}} replaced with test123abc"
    }
  ],
  "root_cause_rules": [],
  "rule_analysis": [],
  "scope_gate": {
    "entered": true,
    "g0_root_cause_fired": 0,
    "g1_content_signature": false,
    "g2_app_state_required": true,
    "g3_mutatable_payload": false,
    "g4_deterministic_cve_signature": true,
    "decision": "virtual-patch-only",
    "rationale": "No content anomaly token in exploit — request is well-formed SOAP XML with valid Content-Type and headers. The exploit is the absence of proper authentication (UsernameToken with no password accepted), not the presence of malicious content. A WAF cannot know that /CMSPages/Staging/SyncServer.asmx should be auth-protected without app-specific knowledge. A deterministic virtual-patch is possible: match on fixed path + POST + text/xml + SOAPAction header + UsernameToken in body, but this is Kentico-CMS-specific, not suitable for CRS core."
  }
}
